app/controllers/posts_controller.rb

  def show
    @post = Post.published.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."published" = 't' AND "posts"."id" = ? LIMIT 1  [["id", "1"]]